zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxSrc_reg.h
/** \brief 14C, QSPI4 Phase Transition Service Request */
#define SRC_QSPI_QSPI4_PT /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003814Cu)
/** Alias (User Manual Name) for SRC_QSPI_QSPI4_PT.
* To use register names with standard convension, please use SRC_QSPI_QSPI4_PT.
*/
#define SRC_QSPI4PT (SRC_QSPI_QSPI4_PT)

/** \brief 150, QSPI4 User Defined Service Request */
#define SRC_QSPI_QSPI4_U /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038150u)
/** Alias (User Manual Name) for SRC_QSPI_QSPI4_U.
* To use register names with standard convension, please use SRC_QSPI_QSPI4_U.
*/
#define SRC_QSPI4U (SRC_QSPI_QSPI4_U)

/** \brief 154, QSPI5 Transmit Service Request */
#define SRC_QSPI_QSPI5_TX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038154u)
/** Alias (User Manual Name) for SRC_QSPI_QSPI5_TX.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_TX.
*/
#define SRC_QSPI5TX (SRC_QSPI_QSPI5_TX)

/** \brief 158, QSPI5 Receive Service Request */
#define SRC_QSPI_QSPI5_RX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038158u)
/** Alias (User Manual Name) for SRC_QSPI_QSPI5_RX.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_RX.
*/
#define SRC_QSPI5RX (SRC_QSPI_QSPI5_RX)

/** \brief 15C, QSPI5 Error Service Request */
#define SRC_QSPI_QSPI5_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003815Cu)
/** Alias (User Manual Name) for SRC_QSPI_QSPI5_ERR.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_ERR.
*/
#define SRC_QSPI5ERR (SRC_QSPI_QSPI5_ERR)

/** \brief 160, QSPI5 Phase Transition Service Request */
#define SRC_QSPI_QSPI5_PT /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038160u)
/** Alias (User Manual Name) for SRC_QSPI_QSPI5_PT.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_PT.
*/
#define SRC_QSPI5PT (SRC_QSPI_QSPI5_PT)

/** \brief 164, QSPI5 User Defined Service Request */
#define SRC_QSPI_QSPI5_U /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038164u)
/** Alias (User Manual Name) for SRC_QSPI_QSPI5_U.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_U.
*/
#define SRC_QSPI5U (SRC_QSPI_QSPI5_U)

/** \brief 178, QSPI2 High Speed Capture Service Request */
#define SRC_QSPI2HC /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038178u)

/** \brief 17C, QSPI3 High Speed Capture Service Request */
#define SRC_QSPI3HC /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003817Cu)

/** \brief 180, HSCT0 Service Request */
#define SRC_HSCT_HSCT0_SR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038180u)
/** Alias (User Manual Name) for SRC_HSCT_HSCT0_SR.
* To use register names with standard convension, please use SRC_HSCT_HSCT0_SR.
*/
#define SRC_HSCT0 (SRC_HSCT_HSCT0_SR)

/** \brief 184, HSCT1 Service Request */
#define SRC_HSCT_HSCT1_SR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038184u)
/** Alias (User Manual Name) for SRC_HSCT_HSCT1_SR.
* To use register names with standard convension, please use SRC_HSCT_HSCT1_SR.
*/
#define SRC_HSCT1 (SRC_HSCT_HSCT1_SR)

/** \brief 190, HSSL0 Channel 0 OK Service Request */
#define SRC_HSSL_HSSL0_CH0_COK /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038190u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH0_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH0_COK.
*/
#define SRC_HSSL0COK0 (SRC_HSSL_HSSL0_CH0_COK)

/** \brief 194, HSSL0 Channel 0 Read Data Service Request */
#define SRC_HSSL_HSSL0_CH0_RDI /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038194u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH0_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH0_RDI.
*/
#define SRC_HSSL0RDI0 (SRC_HSSL_HSSL0_CH0_RDI)

/** \brief 198, HSSL0 Channel 0 Error Service Request */
#define SRC_HSSL_HSSL0_CH0_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038198u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH0_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH0_ERR.
*/
#define SRC_HSSL0ERR0 (SRC_HSSL_HSSL0_CH0_ERR)

/** \brief 19C, HSSL0 Channel 0 Trigger Interrupt Service Request */
#define SRC_HSSL_HSSL0_CH0_TRG /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003819Cu)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH0_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH0_TRG.
*/
#define SRC_HSSL0TRG0 (SRC_HSSL_HSSL0_CH0_TRG)

/** \brief 1A0, HSSL0 Channel 1 OK Service Request */
#define SRC_HSSL_HSSL0_CH1_COK /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381A0u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH1_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH1_COK.
*/
#define SRC_HSSL0COK1 (SRC_HSSL_HSSL0_CH1_COK)

/** \brief 1A4, HSSL0 Channel 1 Read Data Service Request */
#define SRC_HSSL_HSSL0_CH1_RDI /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381A4u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH1_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH1_RDI.
*/
#define SRC_HSSL0RDI1 (SRC_HSSL_HSSL0_CH1_RDI)

/** \brief 1A8, HSSL0 Channel 1 Error Service Request */
#define SRC_HSSL_HSSL0_CH1_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381A8u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH1_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH1_ERR.
*/
#define SRC_HSSL0ERR1 (SRC_HSSL_HSSL0_CH1_ERR)

/** \brief 1AC, HSSL0 Channel 1 Trigger Interrupt Service Request */
#define SRC_HSSL_HSSL0_CH1_TRG /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381ACu)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH1_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH1_TRG.
*/
#define SRC_HSSL0TRG1 (SRC_HSSL_HSSL0_CH1_TRG)

/** \brief 1B0, HSSL0 Channel 2 OK Service Request */
#define SRC_HSSL_HSSL0_CH2_COK /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381B0u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH2_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH2_COK.
*/
#define SRC_HSSL0COK2 (SRC_HSSL_HSSL0_CH2_COK)

/** \brief 1B4, HSSL0 Channel 2 Read Data Service Request */
#define SRC_HSSL_HSSL0_CH2_RDI /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381B4u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH2_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH2_RDI.
*/
#define SRC_HSSL0RDI2 (SRC_HSSL_HSSL0_CH2_RDI)

/** \brief 1B8, HSSL0 Channel 2 Error Service Request */
#define SRC_HSSL_HSSL0_CH2_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381B8u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH2_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH2_ERR.
*/
#define SRC_HSSL0ERR2 (SRC_HSSL_HSSL0_CH2_ERR)

