zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxSrc_reg.h
/** \brief 1BC, HSSL0 Channel 2 Trigger Interrupt Service Request */
#define SRC_HSSL_HSSL0_CH2_TRG /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381BCu)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH2_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH2_TRG.
*/
#define SRC_HSSL0TRG2 (SRC_HSSL_HSSL0_CH2_TRG)

/** \brief 1C0, HSSL0 Channel 3 OK Service Request */
#define SRC_HSSL_HSSL0_CH3_COK /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381C0u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH3_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH3_COK.
*/
#define SRC_HSSL0COK3 (SRC_HSSL_HSSL0_CH3_COK)

/** \brief 1C4, HSSL0 Channel 3 Read Data Service Request */
#define SRC_HSSL_HSSL0_CH3_RDI /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381C4u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH3_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH3_RDI.
*/
#define SRC_HSSL0RDI3 (SRC_HSSL_HSSL0_CH3_RDI)

/** \brief 1C8, HSSL0 Channel 3 Error Service Request */
#define SRC_HSSL_HSSL0_CH3_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381C8u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH3_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH3_ERR.
*/
#define SRC_HSSL0ERR3 (SRC_HSSL_HSSL0_CH3_ERR)

/** \brief 1CC, HSSL0 Channel 3 Trigger Interrupt Service Request */
#define SRC_HSSL_HSSL0_CH3_TRG /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381CCu)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH3_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH3_TRG.
*/
#define SRC_HSSL0TRG3 (SRC_HSSL_HSSL0_CH3_TRG)

/** \brief 1D0, HSSL0 Exception Service Request */
#define SRC_HSSL_HSSL0_EXI /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381D0u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL0_EXI.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_EXI.
*/
#define SRC_HSSL0EXI (SRC_HSSL_HSSL0_EXI)

/** \brief 1D4, HSSL1 Channel 0 OK Service Request */
#define SRC_HSSL_HSSL1_CH0_COK /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381D4u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH0_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH0_COK.
*/
#define SRC_HSSL1COK0 (SRC_HSSL_HSSL1_CH0_COK)

/** \brief 1D8, HSSL1 Channel 0 Read Data Service Request */
#define SRC_HSSL_HSSL1_CH0_RDI /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381D8u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH0_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH0_RDI.
*/
#define SRC_HSSL1RDI0 (SRC_HSSL_HSSL1_CH0_RDI)

/** \brief 1DC, HSSL1 Channel 0 Error Service Request */
#define SRC_HSSL_HSSL1_CH0_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381DCu)
/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH0_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH0_ERR.
*/
#define SRC_HSSL1ERR0 (SRC_HSSL_HSSL1_CH0_ERR)

/** \brief 1E0, HSSL1 Channel 0 Trigger Interrupt Service Request */
#define SRC_HSSL_HSSL1_CH0_TRG /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381E0u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH0_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH0_TRG.
*/
#define SRC_HSSL1TRG0 (SRC_HSSL_HSSL1_CH0_TRG)

/** \brief 1E4, HSSL1 Channel 1 OK Service Request */
#define SRC_HSSL_HSSL1_CH1_COK /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381E4u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH1_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH1_COK.
*/
#define SRC_HSSL1COK1 (SRC_HSSL_HSSL1_CH1_COK)

/** \brief 1E8, HSSL1 Channel 1 Read Data Service Request */
#define SRC_HSSL_HSSL1_CH1_RDI /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381E8u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH1_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH1_RDI.
*/
#define SRC_HSSL1RDI1 (SRC_HSSL_HSSL1_CH1_RDI)

/** \brief 1EC, HSSL1 Channel 1 Error Service Request */
#define SRC_HSSL_HSSL1_CH1_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381ECu)
/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH1_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH1_ERR.
*/
#define SRC_HSSL1ERR1 (SRC_HSSL_HSSL1_CH1_ERR)

/** \brief 1F0, HSSL1 Channel 1 Trigger Interrupt Service Request */
#define SRC_HSSL_HSSL1_CH1_TRG /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381F0u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH1_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH1_TRG.
*/
#define SRC_HSSL1TRG1 (SRC_HSSL_HSSL1_CH1_TRG)

/** \brief 1F4, HSSL1 Channel 2 OK Service Request */
#define SRC_HSSL_HSSL1_CH2_COK /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381F4u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH2_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH2_COK.
*/
#define SRC_HSSL1COK2 (SRC_HSSL_HSSL1_CH2_COK)

/** \brief 1F8, HSSL1 Channel 2 Read Data Service Request */
#define SRC_HSSL_HSSL1_CH2_RDI /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381F8u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH2_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH2_RDI.
*/
#define SRC_HSSL1RDI2 (SRC_HSSL_HSSL1_CH2_RDI)

/** \brief 1FC, HSSL1 Channel 2 Error Service Request */
#define SRC_HSSL_HSSL1_CH2_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381FCu)
/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH2_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH2_ERR.
*/
#define SRC_HSSL1ERR2 (SRC_HSSL_HSSL1_CH2_ERR)

/** \brief 200, HSSL1 Channel 2 Trigger Interrupt Service Request */
#define SRC_HSSL_HSSL1_CH2_TRG /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038200u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH2_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH2_TRG.
*/
#define SRC_HSSL1TRG2 (SRC_HSSL_HSSL1_CH2_TRG)

/** \brief 204, HSSL1 Channel 3 OK Service Request */
#define SRC_HSSL_HSSL1_CH3_COK /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038204u)
/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH3_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH3_COK.
*/
#define SRC_HSSL1COK3 (SRC_HSSL_HSSL1_CH3_COK)

