zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxSrc_reg.h
/** \brief 45C, DMA Channel  59 Service Request */
#define SRC_DMA_DMA0_CH59 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003845Cu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH59.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH59.
*/
#define SRC_DMACH59 (SRC_DMA_DMA0_CH59)

/** \brief 460, DMA Channel  60 Service Request */
#define SRC_DMA_DMA0_CH60 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038460u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH60.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH60.
*/
#define SRC_DMACH60 (SRC_DMA_DMA0_CH60)

/** \brief 464, DMA Channel  61 Service Request */
#define SRC_DMA_DMA0_CH61 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038464u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH61.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH61.
*/
#define SRC_DMACH61 (SRC_DMA_DMA0_CH61)

/** \brief 468, DMA Channel  62 Service Request */
#define SRC_DMA_DMA0_CH62 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038468u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH62.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH62.
*/
#define SRC_DMACH62 (SRC_DMA_DMA0_CH62)

/** \brief 46C, DMA Channel  63 Service Request */
#define SRC_DMA_DMA0_CH63 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003846Cu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH63.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH63.
*/
#define SRC_DMACH63 (SRC_DMA_DMA0_CH63)

/** \brief 470, DMA Channel  64 Service Request */
#define SRC_DMA_DMA0_CH64 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038470u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH64.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH64.
*/
#define SRC_DMACH64 (SRC_DMA_DMA0_CH64)

/** \brief 474, DMA Channel  65 Service Request */
#define SRC_DMA_DMA0_CH65 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038474u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH65.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH65.
*/
#define SRC_DMACH65 (SRC_DMA_DMA0_CH65)

/** \brief 478, DMA Channel  66 Service Request */
#define SRC_DMA_DMA0_CH66 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038478u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH66.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH66.
*/
#define SRC_DMACH66 (SRC_DMA_DMA0_CH66)

/** \brief 47C, DMA Channel  67 Service Request */
#define SRC_DMA_DMA0_CH67 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003847Cu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH67.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH67.
*/
#define SRC_DMACH67 (SRC_DMA_DMA0_CH67)

/** \brief 480, DMA Channel  68 Service Request */
#define SRC_DMA_DMA0_CH68 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038480u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH68.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH68.
*/
#define SRC_DMACH68 (SRC_DMA_DMA0_CH68)

/** \brief 484, DMA Channel  69 Service Request */
#define SRC_DMA_DMA0_CH69 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038484u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH69.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH69.
*/
#define SRC_DMACH69 (SRC_DMA_DMA0_CH69)

/** \brief 488, DMA Channel  70 Service Request */
#define SRC_DMA_DMA0_CH70 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038488u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH70.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH70.
*/
#define SRC_DMACH70 (SRC_DMA_DMA0_CH70)

/** \brief 48C, DMA Channel  71 Service Request */
#define SRC_DMA_DMA0_CH71 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003848Cu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH71.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH71.
*/
#define SRC_DMACH71 (SRC_DMA_DMA0_CH71)

/** \brief 490, DMA Channel  72 Service Request */
#define SRC_DMA_DMA0_CH72 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038490u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH72.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH72.
*/
#define SRC_DMACH72 (SRC_DMA_DMA0_CH72)

/** \brief 494, DMA Channel  73 Service Request */
#define SRC_DMA_DMA0_CH73 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038494u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH73.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH73.
*/
#define SRC_DMACH73 (SRC_DMA_DMA0_CH73)

/** \brief 498, DMA Channel  74 Service Request */
#define SRC_DMA_DMA0_CH74 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038498u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH74.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH74.
*/
#define SRC_DMACH74 (SRC_DMA_DMA0_CH74)

/** \brief 49C, DMA Channel  75 Service Request */
#define SRC_DMA_DMA0_CH75 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003849Cu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH75.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH75.
*/
#define SRC_DMACH75 (SRC_DMA_DMA0_CH75)

/** \brief 4A0, DMA Channel  76 Service Request */
#define SRC_DMA_DMA0_CH76 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384A0u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH76.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH76.
*/
#define SRC_DMACH76 (SRC_DMA_DMA0_CH76)

/** \brief 4A4, DMA Channel  77 Service Request */
#define SRC_DMA_DMA0_CH77 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384A4u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH77.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH77.
*/
#define SRC_DMACH77 (SRC_DMA_DMA0_CH77)

/** \brief 4A8, DMA Channel  78 Service Request */
#define SRC_DMA_DMA0_CH78 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384A8u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH78.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH78.
*/
#define SRC_DMACH78 (SRC_DMA_DMA0_CH78)

/** \brief 4AC, DMA Channel  79 Service Request */
#define SRC_DMA_DMA0_CH79 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384ACu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH79.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH79.
*/
#define SRC_DMACH79 (SRC_DMA_DMA0_CH79)

