zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxSrc_reg.h
/** \brief 4B0, DMA Channel  80 Service Request */
#define SRC_DMA_DMA0_CH80 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384B0u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH80.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH80.
*/
#define SRC_DMACH80 (SRC_DMA_DMA0_CH80)

/** \brief 4B4, DMA Channel  81 Service Request */
#define SRC_DMA_DMA0_CH81 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384B4u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH81.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH81.
*/
#define SRC_DMACH81 (SRC_DMA_DMA0_CH81)

/** \brief 4B8, DMA Channel  82 Service Request */
#define SRC_DMA_DMA0_CH82 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384B8u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH82.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH82.
*/
#define SRC_DMACH82 (SRC_DMA_DMA0_CH82)

/** \brief 4BC, DMA Channel  83 Service Request */
#define SRC_DMA_DMA0_CH83 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384BCu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH83.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH83.
*/
#define SRC_DMACH83 (SRC_DMA_DMA0_CH83)

/** \brief 4C0, DMA Channel  84 Service Request */
#define SRC_DMA_DMA0_CH84 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384C0u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH84.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH84.
*/
#define SRC_DMACH84 (SRC_DMA_DMA0_CH84)

/** \brief 4C4, DMA Channel  85 Service Request */
#define SRC_DMA_DMA0_CH85 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384C4u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH85.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH85.
*/
#define SRC_DMACH85 (SRC_DMA_DMA0_CH85)

/** \brief 4C8, DMA Channel  86 Service Request */
#define SRC_DMA_DMA0_CH86 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384C8u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH86.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH86.
*/
#define SRC_DMACH86 (SRC_DMA_DMA0_CH86)

/** \brief 4CC, DMA Channel  87 Service Request */
#define SRC_DMA_DMA0_CH87 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384CCu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH87.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH87.
*/
#define SRC_DMACH87 (SRC_DMA_DMA0_CH87)

/** \brief 4D0, DMA Channel  88 Service Request */
#define SRC_DMA_DMA0_CH88 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384D0u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH88.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH88.
*/
#define SRC_DMACH88 (SRC_DMA_DMA0_CH88)

/** \brief 4D4, DMA Channel  89 Service Request */
#define SRC_DMA_DMA0_CH89 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384D4u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH89.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH89.
*/
#define SRC_DMACH89 (SRC_DMA_DMA0_CH89)

/** \brief 4D8, DMA Channel  90 Service Request */
#define SRC_DMA_DMA0_CH90 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384D8u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH90.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH90.
*/
#define SRC_DMACH90 (SRC_DMA_DMA0_CH90)

/** \brief 4DC, DMA Channel  91 Service Request */
#define SRC_DMA_DMA0_CH91 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384DCu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH91.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH91.
*/
#define SRC_DMACH91 (SRC_DMA_DMA0_CH91)

/** \brief 4E0, DMA Channel  92 Service Request */
#define SRC_DMA_DMA0_CH92 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384E0u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH92.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH92.
*/
#define SRC_DMACH92 (SRC_DMA_DMA0_CH92)

/** \brief 4E4, DMA Channel  93 Service Request */
#define SRC_DMA_DMA0_CH93 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384E4u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH93.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH93.
*/
#define SRC_DMACH93 (SRC_DMA_DMA0_CH93)

/** \brief 4E8, DMA Channel  94 Service Request */
#define SRC_DMA_DMA0_CH94 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384E8u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH94.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH94.
*/
#define SRC_DMACH94 (SRC_DMA_DMA0_CH94)

/** \brief 4EC, DMA Channel  95 Service Request */
#define SRC_DMA_DMA0_CH95 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384ECu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH95.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH95.
*/
#define SRC_DMACH95 (SRC_DMA_DMA0_CH95)

/** \brief 4F0, DMA Channel  96 Service Request */
#define SRC_DMA_DMA0_CH96 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384F0u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH96.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH96.
*/
#define SRC_DMACH96 (SRC_DMA_DMA0_CH96)

/** \brief 4F4, DMA Channel  97 Service Request */
#define SRC_DMA_DMA0_CH97 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384F4u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH97.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH97.
*/
#define SRC_DMACH97 (SRC_DMA_DMA0_CH97)

/** \brief 4F8, DMA Channel  98 Service Request */
#define SRC_DMA_DMA0_CH98 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384F8u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH98.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH98.
*/
#define SRC_DMACH98 (SRC_DMA_DMA0_CH98)

/** \brief 4FC, DMA Channel  99 Service Request */
#define SRC_DMA_DMA0_CH99 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384FCu)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH99.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH99.
*/
#define SRC_DMACH99 (SRC_DMA_DMA0_CH99)

/** \brief 500, DMA Channel  100 Service Request */
#define SRC_DMA_DMA0_CH100 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038500u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH100.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH100.
*/
#define SRC_DMACH100 (SRC_DMA_DMA0_CH100)

/** \brief 504, DMA Channel  101 Service Request */
#define SRC_DMA_DMA0_CH101 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038504u)
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH101.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH101.
*/
#define SRC_DMACH101 (SRC_DMA_DMA0_CH101)

