zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxSrc_reg.h
/** \brief 780, DSADC SRM2 Service Request */
#define SRC_DSADC_DSADC2_SRM /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038780u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC2_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC2_SRM.
*/
#define SRC_DSADCSRM2 (SRC_DSADC_DSADC2_SRM)

/** \brief 784, DSADC SRA2 Service Request */
#define SRC_DSADC_DSADC2_SRA /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038784u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC2_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC2_SRA.
*/
#define SRC_DSADCSRA2 (SRC_DSADC_DSADC2_SRA)

/** \brief 788, DSADC SRM3 Service Request */
#define SRC_DSADC_DSADC3_SRM /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038788u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC3_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC3_SRM.
*/
#define SRC_DSADCSRM3 (SRC_DSADC_DSADC3_SRM)

/** \brief 78C, DSADC SRA3 Service Request */
#define SRC_DSADC_DSADC3_SRA /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003878Cu)
/** Alias (User Manual Name) for SRC_DSADC_DSADC3_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC3_SRA.
*/
#define SRC_DSADCSRA3 (SRC_DSADC_DSADC3_SRA)

/** \brief 790, DSADC SRM4 Service Request */
#define SRC_DSADC_DSADC4_SRM /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038790u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC4_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC4_SRM.
*/
#define SRC_DSADCSRM4 (SRC_DSADC_DSADC4_SRM)

/** \brief 794, DSADC SRA4 Service Request */
#define SRC_DSADC_DSADC4_SRA /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038794u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC4_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC4_SRA.
*/
#define SRC_DSADCSRA4 (SRC_DSADC_DSADC4_SRA)

/** \brief 798, DSADC SRM5 Service Request */
#define SRC_DSADC_DSADC5_SRM /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038798u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC5_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC5_SRM.
*/
#define SRC_DSADCSRM5 (SRC_DSADC_DSADC5_SRM)

/** \brief 79C, DSADC SRA5 Service Request */
#define SRC_DSADC_DSADC5_SRA /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003879Cu)
/** Alias (User Manual Name) for SRC_DSADC_DSADC5_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC5_SRA.
*/
#define SRC_DSADCSRA5 (SRC_DSADC_DSADC5_SRA)

/** \brief 7A0, DSADC SRM6 Service Request */
#define SRC_DSADC_DSADC6_SRM /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387A0u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC6_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC6_SRM.
*/
#define SRC_DSADCSRM6 (SRC_DSADC_DSADC6_SRM)

/** \brief 7A4, DSADC SRA6 Service Request */
#define SRC_DSADC_DSADC6_SRA /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387A4u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC6_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC6_SRA.
*/
#define SRC_DSADCSRA6 (SRC_DSADC_DSADC6_SRA)

/** \brief 7A8, DSADC SRM7 Service Request */
#define SRC_DSADC_DSADC7_SRM /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387A8u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC7_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC7_SRM.
*/
#define SRC_DSADCSRM7 (SRC_DSADC_DSADC7_SRM)

/** \brief 7AC, DSADC SRA7 Service Request */
#define SRC_DSADC_DSADC7_SRA /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387ACu)
/** Alias (User Manual Name) for SRC_DSADC_DSADC7_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC7_SRA.
*/
#define SRC_DSADCSRA7 (SRC_DSADC_DSADC7_SRA)

/** \brief 7B0, DSADC SRM8 Service Request */
#define SRC_DSADC_DSADC8_SRM /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387B0u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC8_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC8_SRM.
*/
#define SRC_DSADCSRM8 (SRC_DSADC_DSADC8_SRM)

/** \brief 7B4, DSADC SRA8 Service Request */
#define SRC_DSADC_DSADC8_SRA /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387B4u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC8_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC8_SRA.
*/
#define SRC_DSADCSRA8 (SRC_DSADC_DSADC8_SRA)

/** \brief 7B8, DSADC SRM9 Service Request */
#define SRC_DSADC_DSADC9_SRM /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387B8u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC9_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC9_SRM.
*/
#define SRC_DSADCSRM9 (SRC_DSADC_DSADC9_SRM)

/** \brief 7BC, DSADC SRA9 Service Request */
#define SRC_DSADC_DSADC9_SRA /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387BCu)
/** Alias (User Manual Name) for SRC_DSADC_DSADC9_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC9_SRA.
*/
#define SRC_DSADCSRA9 (SRC_DSADC_DSADC9_SRA)

/** \brief 7C0, DSADC SRM10 Service Request */
#define SRC_DSADC_DSADC10_SRM /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387C0u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC10_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC10_SRM.
*/
#define SRC_DSADCSRM10 (SRC_DSADC_DSADC10_SRM)

/** \brief 7C4, DSADC SRA10 Service Request */
#define SRC_DSADC_DSADC10_SRA /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387C4u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC10_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC10_SRA.
*/
#define SRC_DSADCSRA10 (SRC_DSADC_DSADC10_SRA)

/** \brief 7C8, DSADC SRM11 Service Request */
#define SRC_DSADC_DSADC11_SRM /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387C8u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC11_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC11_SRM.
*/
#define SRC_DSADCSRM11 (SRC_DSADC_DSADC11_SRM)

/** \brief 7CC, DSADC SRA11 Service Request */
#define SRC_DSADC_DSADC11_SRA /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387CCu)
/** Alias (User Manual Name) for SRC_DSADC_DSADC11_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC11_SRA.
*/
#define SRC_DSADCSRA11 (SRC_DSADC_DSADC11_SRA)

/** \brief 7D0, DSADC SRM12 Service Request */
#define SRC_DSADC_DSADC12_SRM /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387D0u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC12_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC12_SRM.
*/
#define SRC_DSADCSRM12 (SRC_DSADC_DSADC12_SRM)

/** \brief 7D4, DSADC SRA12 Service Request */
#define SRC_DSADC_DSADC12_SRA /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387D4u)
/** Alias (User Manual Name) for SRC_DSADC_DSADC12_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC12_SRA.
*/
#define SRC_DSADCSRA12 (SRC_DSADC_DSADC12_SRA)

