zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxSrc_reg.h
/** \brief 9DC, General Purpose Group 2 Service Request 3 */
#define SRC_GPSR_GPSR2_SR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389DCu)
/** Alias (User Manual Name) for SRC_GPSR_GPSR2_SR3.
* To use register names with standard convension, please use SRC_GPSR_GPSR2_SR3.
*/
#define SRC_GPSR23 (SRC_GPSR_GPSR2_SR3)

/** \brief 9E0, General Purpose Group 2 Service Request 4 */
#define SRC_GPSR_GPSR2_SR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389E0u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR2_SR4.
* To use register names with standard convension, please use SRC_GPSR_GPSR2_SR4.
*/
#define SRC_GPSR24 (SRC_GPSR_GPSR2_SR4)

/** \brief 9E4, General Purpose Group 2 Service Request 5 */
#define SRC_GPSR_GPSR2_SR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389E4u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR2_SR5.
* To use register names with standard convension, please use SRC_GPSR_GPSR2_SR5.
*/
#define SRC_GPSR25 (SRC_GPSR_GPSR2_SR5)

/** \brief 9E8, General Purpose Group 2 Service Request 6 */
#define SRC_GPSR_GPSR2_SR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389E8u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR2_SR6.
* To use register names with standard convension, please use SRC_GPSR_GPSR2_SR6.
*/
#define SRC_GPSR26 (SRC_GPSR_GPSR2_SR6)

/** \brief 9EC, General Purpose Group 2 Service Request 7 */
#define SRC_GPSR_GPSR2_SR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389ECu)
/** Alias (User Manual Name) for SRC_GPSR_GPSR2_SR7.
* To use register names with standard convension, please use SRC_GPSR_GPSR2_SR7.
*/
#define SRC_GPSR27 (SRC_GPSR_GPSR2_SR7)

/** \brief 9F0, General Purpose Group 3 Service Request 0 */
#define SRC_GPSR_GPSR3_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389F0u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR3_SR0.
* To use register names with standard convension, please use SRC_GPSR_GPSR3_SR0.
*/
#define SRC_GPSR30 (SRC_GPSR_GPSR3_SR0)

/** \brief 9F4, General Purpose Group 3 Service Request 1 */
#define SRC_GPSR_GPSR3_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389F4u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR3_SR1.
* To use register names with standard convension, please use SRC_GPSR_GPSR3_SR1.
*/
#define SRC_GPSR31 (SRC_GPSR_GPSR3_SR1)

/** \brief 9F8, General Purpose Group 3 Service Request 2 */
#define SRC_GPSR_GPSR3_SR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389F8u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR3_SR2.
* To use register names with standard convension, please use SRC_GPSR_GPSR3_SR2.
*/
#define SRC_GPSR32 (SRC_GPSR_GPSR3_SR2)

/** \brief 9FC, General Purpose Group 3 Service Request 3 */
#define SRC_GPSR_GPSR3_SR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389FCu)
/** Alias (User Manual Name) for SRC_GPSR_GPSR3_SR3.
* To use register names with standard convension, please use SRC_GPSR_GPSR3_SR3.
*/
#define SRC_GPSR33 (SRC_GPSR_GPSR3_SR3)

/** \brief A00, General Purpose Group 3 Service Request 4 */
#define SRC_GPSR_GPSR3_SR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A00u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR3_SR4.
* To use register names with standard convension, please use SRC_GPSR_GPSR3_SR4.
*/
#define SRC_GPSR34 (SRC_GPSR_GPSR3_SR4)

/** \brief A04, General Purpose Group 3 Service Request 5 */
#define SRC_GPSR_GPSR3_SR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A04u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR3_SR5.
* To use register names with standard convension, please use SRC_GPSR_GPSR3_SR5.
*/
#define SRC_GPSR35 (SRC_GPSR_GPSR3_SR5)

/** \brief A08, General Purpose Group 3 Service Request 6 */
#define SRC_GPSR_GPSR3_SR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A08u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR3_SR6.
* To use register names with standard convension, please use SRC_GPSR_GPSR3_SR6.
*/
#define SRC_GPSR36 (SRC_GPSR_GPSR3_SR6)

/** \brief A0C, General Purpose Group 3 Service Request 7 */
#define SRC_GPSR_GPSR3_SR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A0Cu)
/** Alias (User Manual Name) for SRC_GPSR_GPSR3_SR7.
* To use register names with standard convension, please use SRC_GPSR_GPSR3_SR7.
*/
#define SRC_GPSR37 (SRC_GPSR_GPSR3_SR7)

/** \brief A10, General Purpose Group 4 Service Request 0 */
#define SRC_GPSR_GPSR4_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A10u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR4_SR0.
* To use register names with standard convension, please use SRC_GPSR_GPSR4_SR0.
*/
#define SRC_GPSR40 (SRC_GPSR_GPSR4_SR0)

/** \brief A14, General Purpose Group 4 Service Request 1 */
#define SRC_GPSR_GPSR4_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A14u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR4_SR1.
* To use register names with standard convension, please use SRC_GPSR_GPSR4_SR1.
*/
#define SRC_GPSR41 (SRC_GPSR_GPSR4_SR1)

/** \brief A18, General Purpose Group 4 Service Request 2 */
#define SRC_GPSR_GPSR4_SR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A18u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR4_SR2.
* To use register names with standard convension, please use SRC_GPSR_GPSR4_SR2.
*/
#define SRC_GPSR42 (SRC_GPSR_GPSR4_SR2)

/** \brief A1C, General Purpose Group 4 Service Request 3 */
#define SRC_GPSR_GPSR4_SR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A1Cu)
/** Alias (User Manual Name) for SRC_GPSR_GPSR4_SR3.
* To use register names with standard convension, please use SRC_GPSR_GPSR4_SR3.
*/
#define SRC_GPSR43 (SRC_GPSR_GPSR4_SR3)

/** \brief A20, General Purpose Group 4 Service Request 4 */
#define SRC_GPSR_GPSR4_SR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A20u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR4_SR4.
* To use register names with standard convension, please use SRC_GPSR_GPSR4_SR4.
*/
#define SRC_GPSR44 (SRC_GPSR_GPSR4_SR4)

/** \brief A24, General Purpose Group 4 Service Request 5 */
#define SRC_GPSR_GPSR4_SR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A24u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR4_SR5.
* To use register names with standard convension, please use SRC_GPSR_GPSR4_SR5.
*/
#define SRC_GPSR45 (SRC_GPSR_GPSR4_SR5)

