zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxSrc_reg.h
/** \brief A28, General Purpose Group 4 Service Request 6 */
#define SRC_GPSR_GPSR4_SR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A28u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR4_SR6.
* To use register names with standard convension, please use SRC_GPSR_GPSR4_SR6.
*/
#define SRC_GPSR46 (SRC_GPSR_GPSR4_SR6)

/** \brief A2C, General Purpose Group 4 Service Request 7 */
#define SRC_GPSR_GPSR4_SR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A2Cu)
/** Alias (User Manual Name) for SRC_GPSR_GPSR4_SR7.
* To use register names with standard convension, please use SRC_GPSR_GPSR4_SR7.
*/
#define SRC_GPSR47 (SRC_GPSR_GPSR4_SR7)

/** \brief A30, General Purpose Group 5 Service Request 0 */
#define SRC_GPSR_GPSR5_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A30u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR5_SR0.
* To use register names with standard convension, please use SRC_GPSR_GPSR5_SR0.
*/
#define SRC_GPSR50 (SRC_GPSR_GPSR5_SR0)

/** \brief A34, General Purpose Group 5 Service Request 1 */
#define SRC_GPSR_GPSR5_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A34u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR5_SR1.
* To use register names with standard convension, please use SRC_GPSR_GPSR5_SR1.
*/
#define SRC_GPSR51 (SRC_GPSR_GPSR5_SR1)

/** \brief A38, General Purpose Group 5 Service Request 2 */
#define SRC_GPSR_GPSR5_SR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A38u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR5_SR2.
* To use register names with standard convension, please use SRC_GPSR_GPSR5_SR2.
*/
#define SRC_GPSR52 (SRC_GPSR_GPSR5_SR2)

/** \brief A3C, General Purpose Group 5 Service Request 3 */
#define SRC_GPSR_GPSR5_SR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A3Cu)
/** Alias (User Manual Name) for SRC_GPSR_GPSR5_SR3.
* To use register names with standard convension, please use SRC_GPSR_GPSR5_SR3.
*/
#define SRC_GPSR53 (SRC_GPSR_GPSR5_SR3)

/** \brief A40, General Purpose Group 5 Service Request 4 */
#define SRC_GPSR_GPSR5_SR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A40u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR5_SR4.
* To use register names with standard convension, please use SRC_GPSR_GPSR5_SR4.
*/
#define SRC_GPSR54 (SRC_GPSR_GPSR5_SR4)

/** \brief A44, General Purpose Group 5 Service Request 5 */
#define SRC_GPSR_GPSR5_SR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A44u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR5_SR5.
* To use register names with standard convension, please use SRC_GPSR_GPSR5_SR5.
*/
#define SRC_GPSR55 (SRC_GPSR_GPSR5_SR5)

/** \brief A48, General Purpose Group 5 Service Request 6 */
#define SRC_GPSR_GPSR5_SR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A48u)
/** Alias (User Manual Name) for SRC_GPSR_GPSR5_SR6.
* To use register names with standard convension, please use SRC_GPSR_GPSR5_SR6.
*/
#define SRC_GPSR56 (SRC_GPSR_GPSR5_SR6)

/** \brief A4C, General Purpose Group 5 Service Request 7 */
#define SRC_GPSR_GPSR5_SR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A4Cu)
/** Alias (User Manual Name) for SRC_GPSR_GPSR5_SR7.
* To use register names with standard convension, please use SRC_GPSR_GPSR5_SR7.
*/
#define SRC_GPSR57 (SRC_GPSR_GPSR5_SR7)

/** \brief A70, AEI Shared Service Request */
#define SRC_GTM_AEIIRQ /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A70u)
/** Alias (User Manual Name) for SRC_GTM_AEIIRQ.
* To use register names with standard convension, please use SRC_GTM_AEIIRQ.
*/
#define SRC_GTMAEIIRQ (SRC_GTM_AEIIRQ)

/** \brief A74, ARU Shared Service Request 0 */
#define SRC_GTM_ARUIRQ0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A74u)
/** Alias (User Manual Name) for SRC_GTM_ARUIRQ0.
* To use register names with standard convension, please use SRC_GTM_ARUIRQ0.
*/
#define SRC_GTMARUIRQ0 (SRC_GTM_ARUIRQ0)

/** \brief A78, ARU Shared Service Request 1 */
#define SRC_GTM_ARUIRQ1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A78u)
/** Alias (User Manual Name) for SRC_GTM_ARUIRQ1.
* To use register names with standard convension, please use SRC_GTM_ARUIRQ1.
*/
#define SRC_GTMARUIRQ1 (SRC_GTM_ARUIRQ1)

/** \brief A7C, ARU Shared Service Request 2 */
#define SRC_GTM_ARUIRQ2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A7Cu)
/** Alias (User Manual Name) for SRC_GTM_ARUIRQ2.
* To use register names with standard convension, please use SRC_GTM_ARUIRQ2.
*/
#define SRC_GTMARUIRQ2 (SRC_GTM_ARUIRQ2)

/** \brief A80, BRC Shared Service Request */
#define SRC_GTM_BRCIRQ /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A80u)
/** Alias (User Manual Name) for SRC_GTM_BRCIRQ.
* To use register names with standard convension, please use SRC_GTM_BRCIRQ.
*/
#define SRC_GTMBRCIRQ (SRC_GTM_BRCIRQ)

/** \brief A84, CMP Shared Service Request */
#define SRC_GTM_CMBIRQ /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A84u)
/** Alias (User Manual Name) for SRC_GTM_CMBIRQ.
* To use register names with standard convension, please use SRC_GTM_CMBIRQ.
*/
#define SRC_GTMCMPIRQ (SRC_GTM_CMBIRQ)

/** \brief A88, SPE0 Shared Service Request */
#define SRC_GTM_SPEIRQ0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A88u)
/** Alias (User Manual Name) for SRC_GTM_SPEIRQ0.
* To use register names with standard convension, please use SRC_GTM_SPEIRQ0.
*/
#define SRC_GTMSPE0IRQ (SRC_GTM_SPEIRQ0)

/** \brief A8C, SPE1 Shared Service Request */
#define SRC_GTM_SPEIRQ1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A8Cu)
/** Alias (User Manual Name) for SRC_GTM_SPEIRQ1.
* To use register names with standard convension, please use SRC_GTM_SPEIRQ1.
*/
#define SRC_GTMSPE1IRQ (SRC_GTM_SPEIRQ1)

/** \brief A90, SPE2 Shared Service Request */
#define SRC_GTM_SPEIRQ2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A90u)
/** Alias (User Manual Name) for SRC_GTM_SPEIRQ2.
* To use register names with standard convension, please use SRC_GTM_SPEIRQ2.
*/
#define SRC_GTMSPE2IRQ (SRC_GTM_SPEIRQ2)

