zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxSrc_reg.h
/** \brief A94, SPE3 Shared Service Request */
#define SRC_GTM_SPEIRQ3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A94u)
/** Alias (User Manual Name) for SRC_GTM_SPEIRQ3.
* To use register names with standard convension, please use SRC_GTM_SPEIRQ3.
*/
#define SRC_GTMSPE3IRQ (SRC_GTM_SPEIRQ3)

/** \brief A98, SPE4 Shared Service Request */
#define SRC_GTM_SPEIRQ4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A98u)
/** Alias (User Manual Name) for SRC_GTM_SPEIRQ4.
* To use register names with standard convension, please use SRC_GTM_SPEIRQ4.
*/
#define SRC_GTMSPE4IRQ (SRC_GTM_SPEIRQ4)

/** \brief A9C, SPE5 Shared Service Request */
#define SRC_GTM_SPEIRQ5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A9Cu)
/** Alias (User Manual Name) for SRC_GTM_SPEIRQ5.
* To use register names with standard convension, please use SRC_GTM_SPEIRQ5.
*/
#define SRC_GTMSPE5IRQ (SRC_GTM_SPEIRQ5)

/** \brief AA0, PSM0 Shared Service Request 0 */
#define SRC_GTM_PSM0_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AA0u)
/** Alias (User Manual Name) for SRC_GTM_PSM0_0.
* To use register names with standard convension, please use SRC_GTM_PSM0_0.
*/
#define SRC_GTMPSM00 (SRC_GTM_PSM0_0)

/** \brief AA4, PSM0 Shared Service Request 1 */
#define SRC_GTM_PSM0_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AA4u)
/** Alias (User Manual Name) for SRC_GTM_PSM0_1.
* To use register names with standard convension, please use SRC_GTM_PSM0_1.
*/
#define SRC_GTMPSM01 (SRC_GTM_PSM0_1)

/** \brief AA8, PSM0 Shared Service Request 2 */
#define SRC_GTM_PSM0_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AA8u)
/** Alias (User Manual Name) for SRC_GTM_PSM0_2.
* To use register names with standard convension, please use SRC_GTM_PSM0_2.
*/
#define SRC_GTMPSM02 (SRC_GTM_PSM0_2)

/** \brief AAC, PSM0 Shared Service Request 3 */
#define SRC_GTM_PSM0_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AACu)
/** Alias (User Manual Name) for SRC_GTM_PSM0_3.
* To use register names with standard convension, please use SRC_GTM_PSM0_3.
*/
#define SRC_GTMPSM03 (SRC_GTM_PSM0_3)

/** \brief AB0, PSM0 Shared Service Request 4 */
#define SRC_GTM_PSM0_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AB0u)
/** Alias (User Manual Name) for SRC_GTM_PSM0_4.
* To use register names with standard convension, please use SRC_GTM_PSM0_4.
*/
#define SRC_GTMPSM04 (SRC_GTM_PSM0_4)

/** \brief AB4, PSM0 Shared Service Request 5 */
#define SRC_GTM_PSM0_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AB4u)
/** Alias (User Manual Name) for SRC_GTM_PSM0_5.
* To use register names with standard convension, please use SRC_GTM_PSM0_5.
*/
#define SRC_GTMPSM05 (SRC_GTM_PSM0_5)

/** \brief AB8, PSM0 Shared Service Request 6 */
#define SRC_GTM_PSM0_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AB8u)
/** Alias (User Manual Name) for SRC_GTM_PSM0_6.
* To use register names with standard convension, please use SRC_GTM_PSM0_6.
*/
#define SRC_GTMPSM06 (SRC_GTM_PSM0_6)

/** \brief ABC, PSM0 Shared Service Request 7 */
#define SRC_GTM_PSM0_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038ABCu)
/** Alias (User Manual Name) for SRC_GTM_PSM0_7.
* To use register names with standard convension, please use SRC_GTM_PSM0_7.
*/
#define SRC_GTMPSM07 (SRC_GTM_PSM0_7)

/** \brief AC0, PSM1 Shared Service Request 0 */
#define SRC_GTM_PSM1_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AC0u)
/** Alias (User Manual Name) for SRC_GTM_PSM1_0.
* To use register names with standard convension, please use SRC_GTM_PSM1_0.
*/
#define SRC_GTMPSM10 (SRC_GTM_PSM1_0)

/** \brief AC4, PSM1 Shared Service Request 1 */
#define SRC_GTM_PSM1_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AC4u)
/** Alias (User Manual Name) for SRC_GTM_PSM1_1.
* To use register names with standard convension, please use SRC_GTM_PSM1_1.
*/
#define SRC_GTMPSM11 (SRC_GTM_PSM1_1)

/** \brief AC8, PSM1 Shared Service Request 2 */
#define SRC_GTM_PSM1_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AC8u)
/** Alias (User Manual Name) for SRC_GTM_PSM1_2.
* To use register names with standard convension, please use SRC_GTM_PSM1_2.
*/
#define SRC_GTMPSM12 (SRC_GTM_PSM1_2)

/** \brief ACC, PSM1 Shared Service Request 3 */
#define SRC_GTM_PSM1_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038ACCu)
/** Alias (User Manual Name) for SRC_GTM_PSM1_3.
* To use register names with standard convension, please use SRC_GTM_PSM1_3.
*/
#define SRC_GTMPSM13 (SRC_GTM_PSM1_3)

/** \brief AD0, PSM1 Shared Service Request 4 */
#define SRC_GTM_PSM1_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AD0u)
/** Alias (User Manual Name) for SRC_GTM_PSM1_4.
* To use register names with standard convension, please use SRC_GTM_PSM1_4.
*/
#define SRC_GTMPSM14 (SRC_GTM_PSM1_4)

/** \brief AD4, PSM1 Shared Service Request 5 */
#define SRC_GTM_PSM1_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AD4u)
/** Alias (User Manual Name) for SRC_GTM_PSM1_5.
* To use register names with standard convension, please use SRC_GTM_PSM1_5.
*/
#define SRC_GTMPSM15 (SRC_GTM_PSM1_5)

/** \brief AD8, PSM1 Shared Service Request 6 */
#define SRC_GTM_PSM1_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AD8u)
/** Alias (User Manual Name) for SRC_GTM_PSM1_6.
* To use register names with standard convension, please use SRC_GTM_PSM1_6.
*/
#define SRC_GTMPSM16 (SRC_GTM_PSM1_6)

/** \brief ADC, PSM1 Shared Service Request 7 */
#define SRC_GTM_PSM1_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038ADCu)
/** Alias (User Manual Name) for SRC_GTM_PSM1_7.
* To use register names with standard convension, please use SRC_GTM_PSM1_7.
*/
#define SRC_GTMPSM17 (SRC_GTM_PSM1_7)

/** \brief AE0, PSM2 Shared Service Request 0 */
#define SRC_GTM_PSM2_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AE0u)
/** Alias (User Manual Name) for SRC_GTM_PSM2_0.
* To use register names with standard convension, please use SRC_GTM_PSM2_0.
*/
#define SRC_GTMPSM20 (SRC_GTM_PSM2_0)

/** \brief AE4, PSM2 Shared Service Request 1 */
#define SRC_GTM_PSM2_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AE4u)
/** Alias (User Manual Name) for SRC_GTM_PSM2_1.
* To use register names with standard convension, please use SRC_GTM_PSM2_1.
*/
#define SRC_GTMPSM21 (SRC_GTM_PSM2_1)

