zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxSrc_reg.h
/** \brief E74, TOM3 Shared Service Request 1 */
#define SRC_GTM_TOM3_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E74u)
/** Alias (User Manual Name) for SRC_GTM_TOM3_1.
* To use register names with standard convension, please use SRC_GTM_TOM3_1.
*/
#define SRC_GTMTOM31 (SRC_GTM_TOM3_1)

/** \brief E78, TOM3 Shared Service Request 2 */
#define SRC_GTM_TOM3_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E78u)
/** Alias (User Manual Name) for SRC_GTM_TOM3_2.
* To use register names with standard convension, please use SRC_GTM_TOM3_2.
*/
#define SRC_GTMTOM32 (SRC_GTM_TOM3_2)

/** \brief E7C, TOM3 Shared Service Request 3 */
#define SRC_GTM_TOM3_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E7Cu)
/** Alias (User Manual Name) for SRC_GTM_TOM3_3.
* To use register names with standard convension, please use SRC_GTM_TOM3_3.
*/
#define SRC_GTMTOM33 (SRC_GTM_TOM3_3)

/** \brief E80, TOM3 Shared Service Request 4 */
#define SRC_GTM_TOM3_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E80u)
/** Alias (User Manual Name) for SRC_GTM_TOM3_4.
* To use register names with standard convension, please use SRC_GTM_TOM3_4.
*/
#define SRC_GTMTOM34 (SRC_GTM_TOM3_4)

/** \brief E84, TOM3 Shared Service Request 5 */
#define SRC_GTM_TOM3_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E84u)
/** Alias (User Manual Name) for SRC_GTM_TOM3_5.
* To use register names with standard convension, please use SRC_GTM_TOM3_5.
*/
#define SRC_GTMTOM35 (SRC_GTM_TOM3_5)

/** \brief E88, TOM3 Shared Service Request 6 */
#define SRC_GTM_TOM3_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E88u)
/** Alias (User Manual Name) for SRC_GTM_TOM3_6.
* To use register names with standard convension, please use SRC_GTM_TOM3_6.
*/
#define SRC_GTMTOM36 (SRC_GTM_TOM3_6)

/** \brief E8C, TOM3 Shared Service Request 7 */
#define SRC_GTM_TOM3_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E8Cu)
/** Alias (User Manual Name) for SRC_GTM_TOM3_7.
* To use register names with standard convension, please use SRC_GTM_TOM3_7.
*/
#define SRC_GTMTOM37 (SRC_GTM_TOM3_7)

/** \brief E90, TOM4 Shared Service Request 0 */
#define SRC_GTM_TOM4_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E90u)
/** Alias (User Manual Name) for SRC_GTM_TOM4_0.
* To use register names with standard convension, please use SRC_GTM_TOM4_0.
*/
#define SRC_GTMTOM40 (SRC_GTM_TOM4_0)

/** \brief E94, TOM4 Shared Service Request 1 */
#define SRC_GTM_TOM4_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E94u)
/** Alias (User Manual Name) for SRC_GTM_TOM4_1.
* To use register names with standard convension, please use SRC_GTM_TOM4_1.
*/
#define SRC_GTMTOM41 (SRC_GTM_TOM4_1)

/** \brief E98, TOM4 Shared Service Request 2 */
#define SRC_GTM_TOM4_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E98u)
/** Alias (User Manual Name) for SRC_GTM_TOM4_2.
* To use register names with standard convension, please use SRC_GTM_TOM4_2.
*/
#define SRC_GTMTOM42 (SRC_GTM_TOM4_2)

/** \brief E9C, TOM4 Shared Service Request 3 */
#define SRC_GTM_TOM4_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E9Cu)
/** Alias (User Manual Name) for SRC_GTM_TOM4_3.
* To use register names with standard convension, please use SRC_GTM_TOM4_3.
*/
#define SRC_GTMTOM43 (SRC_GTM_TOM4_3)

/** \brief EA0, TOM4 Shared Service Request 4 */
#define SRC_GTM_TOM4_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EA0u)
/** Alias (User Manual Name) for SRC_GTM_TOM4_4.
* To use register names with standard convension, please use SRC_GTM_TOM4_4.
*/
#define SRC_GTMTOM44 (SRC_GTM_TOM4_4)

/** \brief EA4, TOM4 Shared Service Request 5 */
#define SRC_GTM_TOM4_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EA4u)
/** Alias (User Manual Name) for SRC_GTM_TOM4_5.
* To use register names with standard convension, please use SRC_GTM_TOM4_5.
*/
#define SRC_GTMTOM45 (SRC_GTM_TOM4_5)

/** \brief EA8, TOM4 Shared Service Request 6 */
#define SRC_GTM_TOM4_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EA8u)
/** Alias (User Manual Name) for SRC_GTM_TOM4_6.
* To use register names with standard convension, please use SRC_GTM_TOM4_6.
*/
#define SRC_GTMTOM46 (SRC_GTM_TOM4_6)

/** \brief EAC, TOM4 Shared Service Request 7 */
#define SRC_GTM_TOM4_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EACu)
/** Alias (User Manual Name) for SRC_GTM_TOM4_7.
* To use register names with standard convension, please use SRC_GTM_TOM4_7.
*/
#define SRC_GTMTOM47 (SRC_GTM_TOM4_7)

/** \brief EB0, TOM5 Shared Service Request 0 */
#define SRC_GTM_TOM5_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EB0u)
/** Alias (User Manual Name) for SRC_GTM_TOM5_0.
* To use register names with standard convension, please use SRC_GTM_TOM5_0.
*/
#define SRC_GTMTOM50 (SRC_GTM_TOM5_0)

/** \brief EB4, TOM5 Shared Service Request 1 */
#define SRC_GTM_TOM5_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EB4u)
/** Alias (User Manual Name) for SRC_GTM_TOM5_1.
* To use register names with standard convension, please use SRC_GTM_TOM5_1.
*/
#define SRC_GTMTOM51 (SRC_GTM_TOM5_1)

/** \brief EB8, TOM5 Shared Service Request 2 */
#define SRC_GTM_TOM5_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EB8u)
/** Alias (User Manual Name) for SRC_GTM_TOM5_2.
* To use register names with standard convension, please use SRC_GTM_TOM5_2.
*/
#define SRC_GTMTOM52 (SRC_GTM_TOM5_2)

/** \brief EBC, TOM5 Shared Service Request 3 */
#define SRC_GTM_TOM5_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EBCu)
/** Alias (User Manual Name) for SRC_GTM_TOM5_3.
* To use register names with standard convension, please use SRC_GTM_TOM5_3.
*/
#define SRC_GTMTOM53 (SRC_GTM_TOM5_3)

/** \brief EC0, TOM5 Shared Service Request 4 */
#define SRC_GTM_TOM5_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EC0u)
/** Alias (User Manual Name) for SRC_GTM_TOM5_4.
* To use register names with standard convension, please use SRC_GTM_TOM5_4.
*/
#define SRC_GTMTOM54 (SRC_GTM_TOM5_4)

/** \brief EC4, TOM5 Shared Service Request 5 */
#define SRC_GTM_TOM5_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EC4u)
/** Alias (User Manual Name) for SRC_GTM_TOM5_5.
* To use register names with standard convension, please use SRC_GTM_TOM5_5.
*/
#define SRC_GTMTOM55 (SRC_GTM_TOM5_5)

/** \brief EC8, TOM5 Shared Service Request 6 */
#define SRC_GTM_TOM5_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EC8u)
/** Alias (User Manual Name) for SRC_GTM_TOM5_6.
* To use register names with standard convension, please use SRC_GTM_TOM5_6.
*/
#define SRC_GTMTOM56 (SRC_GTM_TOM5_6)

/** \brief ECC, TOM5 Shared Service Request 7 */
#define SRC_GTM_TOM5_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038ECCu)
/** Alias (User Manual Name) for SRC_GTM_TOM5_7.
* To use register names with standard convension, please use SRC_GTM_TOM5_7.
*/
#define SRC_GTMTOM57 (SRC_GTM_TOM5_7)

/** \brief EF0, ATOM0 Shared Service Request 0 */
#define SRC_GTM_ATOM0_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EF0u)
/** Alias (User Manual Name) for SRC_GTM_ATOM0_0.
* To use register names with standard convension, please use SRC_GTM_ATOM0_0.
*/
#define SRC_GTMATOM00 (SRC_GTM_ATOM0_0)

