zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxSrc_reg.h
/** \brief EF4, ATOM0 Shared Service Request 1 */
#define SRC_GTM_ATOM0_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EF4u)
/** Alias (User Manual Name) for SRC_GTM_ATOM0_1.
* To use register names with standard convension, please use SRC_GTM_ATOM0_1.
*/
#define SRC_GTMATOM01 (SRC_GTM_ATOM0_1)

/** \brief EF8, ATOM0 Shared Service Request 2 */
#define SRC_GTM_ATOM0_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EF8u)
/** Alias (User Manual Name) for SRC_GTM_ATOM0_2.
* To use register names with standard convension, please use SRC_GTM_ATOM0_2.
*/
#define SRC_GTMATOM02 (SRC_GTM_ATOM0_2)

/** \brief EFC, ATOM0 Shared Service Request 3 */
#define SRC_GTM_ATOM0_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EFCu)
/** Alias (User Manual Name) for SRC_GTM_ATOM0_3.
* To use register names with standard convension, please use SRC_GTM_ATOM0_3.
*/
#define SRC_GTMATOM03 (SRC_GTM_ATOM0_3)

/** \brief F00, ATOM1 Shared Service Request 0 */
#define SRC_GTM_ATOM1_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F00u)
/** Alias (User Manual Name) for SRC_GTM_ATOM1_0.
* To use register names with standard convension, please use SRC_GTM_ATOM1_0.
*/
#define SRC_GTMATOM10 (SRC_GTM_ATOM1_0)

/** \brief F04, ATOM1 Shared Service Request 1 */
#define SRC_GTM_ATOM1_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F04u)
/** Alias (User Manual Name) for SRC_GTM_ATOM1_1.
* To use register names with standard convension, please use SRC_GTM_ATOM1_1.
*/
#define SRC_GTMATOM11 (SRC_GTM_ATOM1_1)

/** \brief F08, ATOM1 Shared Service Request 2 */
#define SRC_GTM_ATOM1_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F08u)
/** Alias (User Manual Name) for SRC_GTM_ATOM1_2.
* To use register names with standard convension, please use SRC_GTM_ATOM1_2.
*/
#define SRC_GTMATOM12 (SRC_GTM_ATOM1_2)

/** \brief F0C, ATOM1 Shared Service Request 3 */
#define SRC_GTM_ATOM1_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F0Cu)
/** Alias (User Manual Name) for SRC_GTM_ATOM1_3.
* To use register names with standard convension, please use SRC_GTM_ATOM1_3.
*/
#define SRC_GTMATOM13 (SRC_GTM_ATOM1_3)

/** \brief F10, ATOM2 Shared Service Request 0 */
#define SRC_GTM_ATOM2_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F10u)
/** Alias (User Manual Name) for SRC_GTM_ATOM2_0.
* To use register names with standard convension, please use SRC_GTM_ATOM2_0.
*/
#define SRC_GTMATOM20 (SRC_GTM_ATOM2_0)

/** \brief F14, ATOM2 Shared Service Request 1 */
#define SRC_GTM_ATOM2_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F14u)
/** Alias (User Manual Name) for SRC_GTM_ATOM2_1.
* To use register names with standard convension, please use SRC_GTM_ATOM2_1.
*/
#define SRC_GTMATOM21 (SRC_GTM_ATOM2_1)

/** \brief F18, ATOM2 Shared Service Request 2 */
#define SRC_GTM_ATOM2_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F18u)
/** Alias (User Manual Name) for SRC_GTM_ATOM2_2.
* To use register names with standard convension, please use SRC_GTM_ATOM2_2.
*/
#define SRC_GTMATOM22 (SRC_GTM_ATOM2_2)

/** \brief F1C, ATOM2 Shared Service Request 3 */
#define SRC_GTM_ATOM2_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F1Cu)
/** Alias (User Manual Name) for SRC_GTM_ATOM2_3.
* To use register names with standard convension, please use SRC_GTM_ATOM2_3.
*/
#define SRC_GTMATOM23 (SRC_GTM_ATOM2_3)

/** \brief F20, ATOM3 Shared Service Request 0 */
#define SRC_GTM_ATOM3_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F20u)
/** Alias (User Manual Name) for SRC_GTM_ATOM3_0.
* To use register names with standard convension, please use SRC_GTM_ATOM3_0.
*/
#define SRC_GTMATOM30 (SRC_GTM_ATOM3_0)

/** \brief F24, ATOM3 Shared Service Request 1 */
#define SRC_GTM_ATOM3_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F24u)
/** Alias (User Manual Name) for SRC_GTM_ATOM3_1.
* To use register names with standard convension, please use SRC_GTM_ATOM3_1.
*/
#define SRC_GTMATOM31 (SRC_GTM_ATOM3_1)

/** \brief F28, ATOM3 Shared Service Request 2 */
#define SRC_GTM_ATOM3_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F28u)
/** Alias (User Manual Name) for SRC_GTM_ATOM3_2.
* To use register names with standard convension, please use SRC_GTM_ATOM3_2.
*/
#define SRC_GTMATOM32 (SRC_GTM_ATOM3_2)

/** \brief F2C, ATOM3 Shared Service Request 3 */
#define SRC_GTM_ATOM3_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F2Cu)
/** Alias (User Manual Name) for SRC_GTM_ATOM3_3.
* To use register names with standard convension, please use SRC_GTM_ATOM3_3.
*/
#define SRC_GTMATOM33 (SRC_GTM_ATOM3_3)

/** \brief F30, ATOM4 Shared Service Request 0 */
#define SRC_GTM_ATOM4_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F30u)
/** Alias (User Manual Name) for SRC_GTM_ATOM4_0.
* To use register names with standard convension, please use SRC_GTM_ATOM4_0.
*/
#define SRC_GTMATOM40 (SRC_GTM_ATOM4_0)

/** \brief F34, ATOM4 Shared Service Request 1 */
#define SRC_GTM_ATOM4_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F34u)
/** Alias (User Manual Name) for SRC_GTM_ATOM4_1.
* To use register names with standard convension, please use SRC_GTM_ATOM4_1.
*/
#define SRC_GTMATOM41 (SRC_GTM_ATOM4_1)

/** \brief F38, ATOM4 Shared Service Request 2 */
#define SRC_GTM_ATOM4_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F38u)
/** Alias (User Manual Name) for SRC_GTM_ATOM4_2.
* To use register names with standard convension, please use SRC_GTM_ATOM4_2.
*/
#define SRC_GTMATOM42 (SRC_GTM_ATOM4_2)

/** \brief F3C, ATOM4 Shared Service Request 3 */
#define SRC_GTM_ATOM4_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F3Cu)
/** Alias (User Manual Name) for SRC_GTM_ATOM4_3.
* To use register names with standard convension, please use SRC_GTM_ATOM4_3.
*/
#define SRC_GTMATOM43 (SRC_GTM_ATOM4_3)

/** \brief F40, ATOM5 Shared Service Request 0 */
#define SRC_GTM_ATOM5_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F40u)
/** Alias (User Manual Name) for SRC_GTM_ATOM5_0.
* To use register names with standard convension, please use SRC_GTM_ATOM5_0.
*/
#define SRC_GTMATOM50 (SRC_GTM_ATOM5_0)

/** \brief F44, ATOM5 Shared Service Request 1 */
#define SRC_GTM_ATOM5_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F44u)
/** Alias (User Manual Name) for SRC_GTM_ATOM5_1.
* To use register names with standard convension, please use SRC_GTM_ATOM5_1.
*/
#define SRC_GTMATOM51 (SRC_GTM_ATOM5_1)

