zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxSrc_reg.h
/** \brief F48, ATOM5 Shared Service Request 2 */
#define SRC_GTM_ATOM5_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F48u)
/** Alias (User Manual Name) for SRC_GTM_ATOM5_2.
* To use register names with standard convension, please use SRC_GTM_ATOM5_2.
*/
#define SRC_GTMATOM52 (SRC_GTM_ATOM5_2)

/** \brief F4C, ATOM5 Shared Service Request 3 */
#define SRC_GTM_ATOM5_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F4Cu)
/** Alias (User Manual Name) for SRC_GTM_ATOM5_3.
* To use register names with standard convension, please use SRC_GTM_ATOM5_3.
*/
#define SRC_GTMATOM53 (SRC_GTM_ATOM5_3)

/** \brief F50, ATOM6 Shared Service Request 0 */
#define SRC_GTM_ATOM6_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F50u)
/** Alias (User Manual Name) for SRC_GTM_ATOM6_0.
* To use register names with standard convension, please use SRC_GTM_ATOM6_0.
*/
#define SRC_GTMATOM60 (SRC_GTM_ATOM6_0)

/** \brief F54, ATOM6 Shared Service Request 1 */
#define SRC_GTM_ATOM6_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F54u)
/** Alias (User Manual Name) for SRC_GTM_ATOM6_1.
* To use register names with standard convension, please use SRC_GTM_ATOM6_1.
*/
#define SRC_GTMATOM61 (SRC_GTM_ATOM6_1)

/** \brief F58, ATOM6 Shared Service Request 2 */
#define SRC_GTM_ATOM6_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F58u)
/** Alias (User Manual Name) for SRC_GTM_ATOM6_2.
* To use register names with standard convension, please use SRC_GTM_ATOM6_2.
*/
#define SRC_GTMATOM62 (SRC_GTM_ATOM6_2)

/** \brief F5C, ATOM6 Shared Service Request 3 */
#define SRC_GTM_ATOM6_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F5Cu)
/** Alias (User Manual Name) for SRC_GTM_ATOM6_3.
* To use register names with standard convension, please use SRC_GTM_ATOM6_3.
*/
#define SRC_GTMATOM63 (SRC_GTM_ATOM6_3)

/** \brief F60, ATOM7 Shared Service Request 0 */
#define SRC_GTM_ATOM7_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F60u)
/** Alias (User Manual Name) for SRC_GTM_ATOM7_0.
* To use register names with standard convension, please use SRC_GTM_ATOM7_0.
*/
#define SRC_GTMATOM70 (SRC_GTM_ATOM7_0)

/** \brief F64, ATOM7 Shared Service Request 1 */
#define SRC_GTM_ATOM7_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F64u)
/** Alias (User Manual Name) for SRC_GTM_ATOM7_1.
* To use register names with standard convension, please use SRC_GTM_ATOM7_1.
*/
#define SRC_GTMATOM71 (SRC_GTM_ATOM7_1)

/** \brief F68, ATOM7 Shared Service Request 2 */
#define SRC_GTM_ATOM7_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F68u)
/** Alias (User Manual Name) for SRC_GTM_ATOM7_2.
* To use register names with standard convension, please use SRC_GTM_ATOM7_2.
*/
#define SRC_GTMATOM72 (SRC_GTM_ATOM7_2)

/** \brief F6C, ATOM7 Shared Service Request 3 */
#define SRC_GTM_ATOM7_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F6Cu)
/** Alias (User Manual Name) for SRC_GTM_ATOM7_3.
* To use register names with standard convension, please use SRC_GTM_ATOM7_3.
*/
#define SRC_GTMATOM73 (SRC_GTM_ATOM7_3)

/** \brief F70, ATOM8 Shared Service Request 0 */
#define SRC_GTM_ATOM8_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F70u)
/** Alias (User Manual Name) for SRC_GTM_ATOM8_0.
* To use register names with standard convension, please use SRC_GTM_ATOM8_0.
*/
#define SRC_GTMATOM80 (SRC_GTM_ATOM8_0)

/** \brief F74, ATOM8 Shared Service Request 1 */
#define SRC_GTM_ATOM8_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F74u)
/** Alias (User Manual Name) for SRC_GTM_ATOM8_1.
* To use register names with standard convension, please use SRC_GTM_ATOM8_1.
*/
#define SRC_GTMATOM81 (SRC_GTM_ATOM8_1)

/** \brief F78, ATOM8 Shared Service Request 2 */
#define SRC_GTM_ATOM8_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F78u)
/** Alias (User Manual Name) for SRC_GTM_ATOM8_2.
* To use register names with standard convension, please use SRC_GTM_ATOM8_2.
*/
#define SRC_GTMATOM82 (SRC_GTM_ATOM8_2)

/** \brief F7C, ATOM8 Shared Service Request 3 */
#define SRC_GTM_ATOM8_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F7Cu)
/** Alias (User Manual Name) for SRC_GTM_ATOM8_3.
* To use register names with standard convension, please use SRC_GTM_ATOM8_3.
*/
#define SRC_GTMATOM83 (SRC_GTM_ATOM8_3)

/** \brief F80, ATOM9 Shared Service Request 0 */
#define SRC_GTM_ATOM9_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F80u)
/** Alias (User Manual Name) for SRC_GTM_ATOM9_0.
* To use register names with standard convension, please use SRC_GTM_ATOM9_0.
*/
#define SRC_GTMATOM90 (SRC_GTM_ATOM9_0)

/** \brief F84, ATOM9 Shared Service Request 1 */
#define SRC_GTM_ATOM9_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F84u)
/** Alias (User Manual Name) for SRC_GTM_ATOM9_1.
* To use register names with standard convension, please use SRC_GTM_ATOM9_1.
*/
#define SRC_GTMATOM91 (SRC_GTM_ATOM9_1)

/** \brief F88, ATOM9 Shared Service Request 2 */
#define SRC_GTM_ATOM9_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F88u)
/** Alias (User Manual Name) for SRC_GTM_ATOM9_2.
* To use register names with standard convension, please use SRC_GTM_ATOM9_2.
*/
#define SRC_GTMATOM92 (SRC_GTM_ATOM9_2)

/** \brief F8C, ATOM9 Shared Service Request 3 */
#define SRC_GTM_ATOM9_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F8Cu)
/** Alias (User Manual Name) for SRC_GTM_ATOM9_3.
* To use register names with standard convension, please use SRC_GTM_ATOM9_3.
*/
#define SRC_GTMATOM93 (SRC_GTM_ATOM9_3)

/** \brief F90, ATOM10 Shared Service Request 0 */
#define SRC_GTM_ATOM10_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F90u)
/** Alias (User Manual Name) for SRC_GTM_ATOM10_0.
* To use register names with standard convension, please use SRC_GTM_ATOM10_0.
*/
#define SRC_GTMATOM100 (SRC_GTM_ATOM10_0)

/** \brief F94, ATOM10 Shared Service Request 1 */
#define SRC_GTM_ATOM10_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F94u)
/** Alias (User Manual Name) for SRC_GTM_ATOM10_1.
* To use register names with standard convension, please use SRC_GTM_ATOM10_1.
*/
#define SRC_GTMATOM101 (SRC_GTM_ATOM10_1)

